stress/stress.yaml
config:
  payload:
    path: "users.csv"
    fields:
      - "user_id"
  target: http://localhost:8080
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 100
      name: "Warm up the application"
    - duration: 10
      arrivalRate: 100
      name: "Sustained max load"
  defaults:
    headers:
      x-api-key: "{{ $processEnvironment.SERVICE_API_KEY }}"
scenarios:
  - flow:
      - get:
          url: "/client/{{user_id}}"